load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 20
      name: Warm up
    - duration: 10
      arrivalRate: 250
      name: Medium load
    - duration: 10
      arrivalRate: 1000
      name: Heavy load

scenarios:
  - name: Redirect test
    flow:
      - get:
          url: "/myLPB3gA"