load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 100
      name: Warm up
    - duration: 15
      arrivalRate: 300
      name: Medium load
    - duration: 20
      arrivalRate: 500
      name: Heavy load

scenarios:
  - name: Redirect test
    flow:
      - get:
          url: "/BWPl5Nwa"