load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: Warm up
    - duration: 60
      arrivalRate: 100
      name: Medium load
    - duration: 60
      arrivalRate: 500
      name: Heavy load

scenarios:
  - name: Redirect test
    flow:
      - get:
          url: "/Cj4RMIMh"